---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.HeatTransferCoefficient
source: html/0400d320-c070-9439-b9cb-6c7b198c965d.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisConstruction.HeatTransferCoefficient Property

The heat transfer coefficient value (U-value) of the construction.

## Syntax (C#)
```csharp
public double HeatTransferCoefficient { get; }
```

## Remarks
A heat transfer coefficient measured in W/m^2K